# Construction Class

---
Construction definition for Project Information.
SystemObject Autodesk.Revit.DBConstruction
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class Construction

    Public Class Construction

    public ref class Construction

    type Construction = class end
The Construction type exposes the following members.
| Name| Description
---|---|---
| Id| Get the id of the Construction.
| Name| Get the name of the Construction.
Top
| Name| Description
---|---|---
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
This is used to define the information in Constructions.xml.
#### Reference
Autodesk.Revit.DB Namespace